10/data/attachments/fd9482ec4c853b73.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_represent_Friend_82722_3</nif:username>
            <nif:friendToBeRequested>soap_friends_6a098ebe-a316-49a3-a6fa-8377ab78b4e0</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>